# Normalize Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
XYZ..::..Normalize Method
XYZ Class See Also
---
Returns a new XYZ whose coordinates are the normalized values from this vector.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public XYZ Normalize()
```

Visual Basic
---
```text
Public Function Normalize As XYZ
```

Visual C++
---
```text
public:
XYZ^ Normalize()
```

# ### Return Value
The normalized XYZ or zero if the vector is almost Zero.
# Remarks
Normalized indicates that the length of this vector equals one (a unit vector).
# See Also
XYZ Class
Autodesk.Revit.DB Namespace